IdeaRS.OpenModel.Material.Material
Material base class

IdeaRS.OpenModel.Material.Material.Name
Name of material

IdeaRS.OpenModel.Material.Material.E
Young's modulus

IdeaRS.OpenModel.Material.Material.G
Shear modulus

IdeaRS.OpenModel.Material.Material.Poisson
Poisson's ratio

IdeaRS.OpenModel.Material.Material.UnitMass
Unit weight

IdeaRS.OpenModel.Material.Material.SpecificHeat
Specific heat capacity

IdeaRS.OpenModel.Material.Material.ThermalExpansion
Thermal expansion

IdeaRS.OpenModel.Material.Material.ThermalConductivity
Thermal conductivity

IdeaRS.OpenModel.Material.Material.IsDefaultMaterial
True if material is default material from the code

IdeaRS.OpenModel.Material.Material.OrderInCode
Order of this material in the code

IdeaRS.OpenModel.Material.Material.StateOfThermalExpansion
State of thermal expansion curvature

IdeaRS.OpenModel.Material.Material.StateOfThermalConductivity
State of thermal conductivity curvature

IdeaRS.OpenModel.Material.Material.StateOfThermalSpecificHeat
State of thermal specific heat curvature

IdeaRS.OpenModel.Material.Material.StateOfThermalStressStrain
State of thermal specific stress-strain curvature

IdeaRS.OpenModel.Material.Material.StateOfThermalStrain
State of thermal strain curvature

IdeaRS.OpenModel.Material.Material.UserThermalSpecificHeatCurvature
User-defined curvature for thermal specific heat { x = Θ[K], y = cp[J/(kg K)] }

IdeaRS.OpenModel.Material.Material.UserThermalConductivityCurvature
User-defined curvature for thermal conductivity curvature { x = Θ[K], y = λc[W/(m K)] }

IdeaRS.OpenModel.Material.Material.UserThermalExpansionCurvature
User-defined curvature for thermal expansion curvature { x = Θ[K], y = γ[K-1] }

IdeaRS.OpenModel.Material.Material.UserThermalStrainCurvature
User-defined curvature for thermal strain curvature { x = Θ[K], y = εc[Δl/l] }

IdeaRS.OpenModel.Material.Material.UserThermalStressStrainCurvature
User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}